<script lang="ts">
	import typing from '$lib/typing';

	const apply = () => {
		// Part of task 2
	};

	const reset = () => {
		// Part of task 2
	};
</script>

<main>
	<input type="number" />
	<button class="apply" on:click={apply}>Apply</button>
	<button class="reset" on:click={reset}>Reset</button>
	<div use:typing={100}>
		<!-- На просторах интернета существует множество интересных площадок, где пользователи могут делиться
		своими знаниями и опытом. Одна из таких площадок — Pikabu, популярный развлекательный портал с
		множеством интересных историй, мемов и другого контента. На Pikabu можно найти увлекательные
		рассказы о рыбалке, в том числе и с хорошим уловом. Пользователи делятся своими впечатлениями от
		процесса ловли рыбы и рассказывают об особенностях своего хобби. На Pikabu также можно найти
		познавательные статьи о различных видах рыб, их особенностях и среде обитания. Это может быть
		полезно как для начинающих рыболовов, так и для тех, кто просто интересуется миром природы.
		Кроме того, на Pikabu есть возможность обсудить свои рыболовные истории с другими
		пользователями, задать вопросы или поделиться опытом. Здесь царит дружелюбная атмосфера, где
		каждый может найти что-то интересное для себя. -->
	</div>
</main>

<style>
	/* Task 1 */
</style>
